#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """✅**<u>اوامر الادمنيه:</u>**

**c** stands for channel play.

/pause - لإيقاف تشغيل الموسيقى مؤقتًا 
/resume or /cresume- استئناف الموسيقى المتوقفة مؤقتًا.
/mute or /cmute- كتم صوت الموسيقى قيد التشغيل.
/unmute or /cunmute- إعادة صوت الموسيقى الصامتة.
/skip or /cskip- تخطي الموسيقى قيد التشغيل الحالية.
/stop or /cstop- أوقف تشغيل الموسيقى.
/shuffle or /cshuffle- ترتيب عشوائي لقائمة التشغيل في قائمة الانتظار
/seek or /cseek - إلى الأمام ابحث عن الموسيقى حسب مدتك
/seekback or /cseekback - للخلف ابحث عن الموسيقى حسب مدتك
/restart - أعد تشغيل البوت لمحادثتك.


✅<u>**تخطي محدد:**</u>
/skip or /cskip [رقم(مثال: 3)] 
    - يتخطى الموسيقى إلى الرقم المحدد في قائمة الانتظار. مثال: /skip 3 سيتخطى الموسيقى إلى الموسيقى في قائمة الانتظار الثالثة وسيتجاهل الموسيقى 1 و 2 في قائمة الانتظار. 

✅<u>**حلقة اللعب:**</u>
/loop or /cloop [يُمكَِن/تعطيل] or [أرقام بين 1-10] 
    - عند التنشيط ، يقوم البوت بتكرار تشغيل الموسيقى الحالية إلى 1-10 مرات في الدردشة الصوتية. افتراضي إلى 10 مرات.

✅<u>**المستخدمون المصدقون:**</u>
يمكن لمستخدمي المصادقة استخدام أوامر المسؤول بدون حقوق المسؤول في الدردشة.

/auth [اسم المستخدم] - أضف مستخدمًا إلى قائمة AUTH بالمجموعة.
/unauth [اسم المستخدم] - قم بإزالة مستخدم من قائمة AUTH بالمجموعة.
/authusers - تحقق AUTH LIST للمجموعة."""


HELP_2 = """✅<u>**تشغيل الأوامر:**</u>

الأوامر المتوفرة = play , vplay , cplay

أوامر ForcePlay = playforce , vplayforce , cplayforce

**c** لتقف على قناة اللعب.
**v** لتقف على تشغيل الفيديو.
**force** لتقف على قوة اللعب

/play or /vplay or /cplay  - سيبدأ البوت في تشغيل استعلامك المحدد على المكالمه أو بث الروابط المباشرة على المكالمه.

/playforce or /vplayforce or /cplayforce -  **Force Play** يوقف مسار التشغيل الحالي على الدردشة الصوتية ويبدأ في تشغيل المسار الذي تم البحث عنه على الفور دون إزعاج / مسح قائمة الانتظار.

/channelplay [اسم مستخدم الدردشة أو معرف] or [Disable] - قم بتوصيل القناة بمجموعة ودفق الموسيقى على الدردشة الصوتية للقناة من مجموعتك.


✅**<u>قواىم تشغيل خادم البوت :</u>**
/playlist  - تحقق من قائمة التشغيل المحفوظة على الخوادم.
/deleteplaylist - احذف أي موسيقى محفوظة في قائمة التشغيل الخاصة بك
/play  - ابدأ تشغيل قائمة التشغيل المحفوظة من الخوادم."""


HELP_3 = """✅<u>**أوامر البوت:**</u>

/stats - احصل على أفضل 10 مسارات للإحصائيات العالمية ، أفضل 10 مستخدمين للروبوت ، أفضل 10 محادثات على الروبوت ، أفضل 10 تم لعبها في محادثة ، إلخ.

/sudolist - تحقق من مستخدمي  سودو 

/lyrics [Music Name] - يبحث في كلمات عن موسيقى معينة على الويب.

/song [Track Name] or [YT Link] - قم بتنزيل أي مقطع صوتي من youtube بتنسيقات mp3 أو mp4.

/player -  احصل على لوحة لعب تفاعلية.

**c** لتقف على قناة اللعب.

/queue or /cqueue-تحقق من قائمة انتظار الموسيقى."""

HELP_4 = """✅<u>**أوامر اضافية:**</u>
/start - ابي بتشغيل البوت 
/help  - احصل على قائمة مساعد الأوامر مع شرح مفصل للأوامر.
/ping- Ping the Bot وتحقق من إحصائيات RAM ووحدة المعالجة المركزية وما إلى ذلك من Bot.

✅<u>**إعدادات المجموعة:**</u>
/settings - احصل على إعدادات المجموعة الكاملة باستخدام الأزرار المضمنة

🔗 **الخيارات في الإعدادات:**

1️⃣ يمكنك ضبط ** جودة الصوت ** التي تريد بثها على الدردشة الصوتية.

2️⃣ يمكنك ضبط ** جودة الفيديو ** التي تريد بثها على الدردشة الصوتية.

3️⃣ ** المستخدمون المصدقون **: - يمكنك تغيير وضع أوامر المسؤول من هنا للجميع أو للمسؤولين فقط. إذا كان كل شخص موجودًا في مجموعتك ، فسيكون قادرًا على استخدام أوامر المسؤول(like /skip, /stop etc)

4️⃣ ** الوضع النظيف: ** عند التمكين ، يحذف رسائل الروبوت بعد 5 دقائق من مجموعتك للتأكد من بقاء محادثتك نظيفة وجيدة.

5️⃣** Command Clean **: عند التنشيط ، سيحذف Bot أوامره المنفذة (/play, /pause, /shuffle, /stop etc) immediately.

6️⃣ ** إعدادات التشغيل: **
/playmode - احصل على لوحة إعدادات تشغيل كاملة مع أزرار حيث يمكنك ضبط إعدادات تشغيل مجموعتك.

<u>خيارات في وضع التشغيل:</u>

1️⃣ ** وضع البحث ** [مباشر أو مضمن] - يغير وضع البحث أثناء العطاء/play mode. 

2️⃣ ** أوامر المسؤول ** [الكل أو المسؤولون] - إذا كان كل شخص موجودًا في مجموعتك فسيكون قادرًا على استخدام أوامر المسؤول(like /skip, /stop etc)

3️⃣** نوع التشغيل ** [الكل أو المسؤولون] - إذا كان المشرفون ، يمكن فقط للمسؤولين الموجودين في المجموعة تشغيل الموسيقى على الدردشة الصوتية. """

HELP_5 = """🔰**<u>إضافة وإزالة مستخدمي SUDO :</u>**
/addsudo [اسم المستخدم أو الرد على المستخدم]
/delsudo [اسم المستخدم أو الرد على المستخدم]

🛃**<u>هيروكو:</u>**
/usage - استخدام داينو.

🌐**<u>تكوين المتغيرات:</u>**
/get_var - احصل على config var من Heroku أو .env.
/del_var - احذف أي var في Heroku أو .env.
/set_var [اسم المتغير] [قيمة] - قم بتعيين Var أو تحديث Var على heroku أو .env. منفصلة Var وقيمتها بمسافة.

🤖**<u>اوامر البوت :</u>**
/reboot - أعد تشغيل البوت الخاص بك. 
/update - تحديث البوت.
/speedtest - تحقق من سرعات الخادم
/maintenance [مفعل /وغير مفعل] 
/logger [مفعل /وغير مفعل] -يقوم البوت بتسجيل الاستعلامات التي تم البحث عنها في مجموعة المسجل.
/get_log [عدد الخطوط] - احصل على سجل للروبوت الخاص بك من heroku أو vps. يعمل لكليهما.
/autoend [تعطيل|تمكين] - قم بتمكين إنهاء البث التلقائي بعد 3 دقائق إذا لم يكن هناك من يستمع.

📈**<u>STATS COMMANDS:</u>**
/activevoice - Check active voice chats on bot.
/activevideo - Check active video calls on bot.
/stats - Check Bots Stats

⚠️**<u>وظيفة الدردشة في القائمة السوداء:</u>**
/blacklistchat [CHAT_ID] - ضع أي دردشة في القائمة السوداء من استخدام Music Bot
/whitelistchat [CHAT_ID] - أضف إلى القائمة البيضاء أي دردشة في القائمة السوداء من استخدام Music Bot
/blacklistedchat -تحقق من جميع الدردشات المدرجة في القائمة السوداء.

👤**<u>الوظيفة المحظورة:</u>**
/block [Username or Reply to a user] - يمنع المستخدم من استخدام أوامر الروبوت.
/unblock [Username or Reply to a user] - قم بإزالة مستخدم من قائمة Bot المحظورة.
/blockedusers -تحقق من قوائم المستخدمين المحظورة

👤**<u>وظيفة GBAN:</u>**
/gban [Username or Reply to a user] - Gban مستخدم من الدردشة التي يقدمها الروبوت ومنعه من استخدام برنامج الروبوت الخاص بك.
/ungban [Username or Reply to a user] - قم بإزالة مستخدم من قائمة gbanned في Bot واسمح له باستخدام الروبوت الخاص بك
/gbannedusers - تحقق من قوائم المستخدمين Gbanned

🎥**<u>وظيفة مكالمات الفيديو:</u>**
/set_video_limit [Number of Chats] - قم بتعيين الحد الأقصى لعدد الدردشات المسموح به لمكالمات الفيديو في المرة الواحدة. افتراضي إلى 3 محادثات.
/videomode [download|m3u8] - إذا تم تمكين وضع التنزيل ، فسيقوم Bot بتنزيل مقاطع الفيديو بدلاً من تشغيلها في شكل M3u8. افتراضيا إلى M3u8. يمكنك استخدام وضع التنزيل عندما لا يتم تشغيل أي استعلام في وضع m3u8.

⚡️**<u>وظيفة البوت الخاص:</u>**
/authorize [CHAT_ID] - اسمح بالمحادثة لاستخدام الروبوت الخاص بك.
/unauthorize [CHAT_ID] - عدم السماح للدردشة باستخدام الروبوت الخاص بك.
/authorized - تحقق من جميع الدردشات المسموح بها من الروبوت الخاص بك.

🌐**<u>وظيفة البث:</u>**
/broadcast [Message or Reply to a Message] - قم ببث أي رسالة إلى الدردشات التي يقدمها برنامج Bot.

<u>options for broadcast:</u>
**-pin** : سيؤدي هذا إلى تثبيت رسالتك
**-pinloud** : سيؤدي هذا إلى تثبيت رسالتك بإشعار عالٍ
**-user** : سيؤدي هذا إلى بث رسالتك للمستخدمين الذين بدأوا برنامج الروبوت الخاص بك.
**-assistant** : سيؤدي هذا إلى بث رسالتك من حساب المساعد الخاص بالبوت الخاص بك.
**-nobot** : سيؤدي هذا إلى إجبار الروبوت الخاص بك على عدم بث الرسالة

**Example:** `/broadcast -user -assistant -pin Hello Testing`

"""
